---
kind: other
id: Properties.T:Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionRoundBar
source: html/a37aad98-92be-450f-55b3-5b584711117e.htm
---
# StructuralSectionRoundBar Properties

Common set of parameters for structural analysis.